MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK24FN256VDC12/mcu.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

#define FTF_IRQn                     FTFA_IRQn
#define FTF_IRQHandler               FTFA_IRQHandler
#define DMA_EARS_REG(base)           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_MASK        This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_SHIFT       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_MASK       This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_SHIFT      This_symbol_has_been_deprecated
#define DMA_EARS                     This_symbol_has_been_deprecated
#define MCM_ISR_REG(base)            MCM_ISCR_REG(base)
#define MCM_ISR_FIOC_MASK            MCM_ISCR_FIOC_MASK
#define MCM_ISR_FIOC_SHIFT           MCM_ISCR_FIOC_SHIFT
#define MCM_ISR_FDZC_MASK            MCM_ISCR_FDZC_MASK
#define MCM_ISR_FDZC_SHIFT           MCM_ISCR_FDZC_SHIFT
#define MCM_ISR_FOFC_MASK            MCM_ISCR_FOFC_MASK
#define MCM_ISR_FOFC_SHIFT           MCM_ISCR_FOFC_SHIFT
#define MCM_ISR_FUFC_MASK            MCM_ISCR_FUFC_MASK
#define MCM_ISR_FUFC_SHIFT           MCM_ISCR_FUFC_SHIFT
#define MCM_ISR_FIXC_MASK            MCM_ISCR_FIXC_MASK
#define MCM_ISR_FIXC_SHIFT           MCM_ISCR_FIXC_SHIFT
#define MCM_ISR_FIDC_MASK            MCM_ISCR_FIDC_MASK
#define MCM_ISR_FIDC_SHIFT           MCM_ISCR_FIDC_SHIFT
#define MCM_ISR_FIOCE_MASK           MCM_ISCR_FIOCE_MASK
#define MCM_ISR_FIOCE_SHIFT          MCM_ISCR_FIOCE_SHIFT
#define MCM_ISR_FDZCE_MASK           MCM_ISCR_FDZCE_MASK
#define MCM_ISR_FDZCE_SHIFT          MCM_ISCR_FDZCE_SHIFT
#define MCM_ISR_FOFCE_MASK           MCM_ISCR_FOFCE_MASK
#define MCM_ISR_FOFCE_SHIFT          MCM_ISCR_FOFCE_SHIFT
#define MCM_ISR_FUFCE_MASK           MCM_ISCR_FUFCE_MASK
#define MCM_ISR_FUFCE_SHIFT          MCM_ISCR_FUFCE_SHIFT
#define MCM_ISR_FIXCE_MASK           MCM_ISCR_FIXCE_MASK
#define MCM_ISR_FIXCE_SHIFT          MCM_ISCR_FIXCE_SHIFT
#define MCM_ISR_FIDCE_MASK           MCM_ISCR_FIDCE_MASK
#define MCM_ISR_FIDCE_SHIFT          MCM_ISCR_FIDCE_SHIFT
#define DSPI0                        SPI0
#define DSPI1                        SPI1
#define DSPI2                        SPI2
#define PTA_BASE                     GPIOA_BASE
#define PTA                          GPIOA
#define PTB_BASE                     GPIOB_BASE
#define PTB                          GPIOB
#define PTC_BASE                     GPIOC_BASE
#define PTC                          GPIOC
#define PTD_BASE                     GPIOD_BASE
#define PTD                          GPIOD
#define PTE_BASE                     GPIOE_BASE
#define PTE                          GPIOE
#define DMAMUX0                      DMAMUX
#define UART_WP7816_T_TYPE0_REG(base) UART_WP7816T0_REG(base)
#define UART_WP7816_T_TYPE1_REG(base) UART_WP7816T1_REG(base)
#define UART_WP7816_T_TYPE0_WI_MASK  UART_WP7816T0_WI_MASK
#define UART_WP7816_T_TYPE0_WI_SHIFT UART_WP7816T0_WI_SHIFT
#define UART_WP7816_T_TYPE0_WI(x)    UART_WP7816T0_WI(x)
#define UART_WP7816_T_TYPE1_BWI_MASK UART_WP7816T1_BWI_MASK
#define UART_WP7816_T_TYPE1_BWI_SHIFT UART_WP7816T1_BWI_SHIFT
#define UART_WP7816_T_TYPE1_BWI(x)   UART_WP7816T1_BWI(x)
#define UART_WP7816_T_TYPE1_CWI_MASK UART_WP7816T1_CWI_MASK
#define UART_WP7816_T_TYPE1_CWI_SHIFT UART_WP7816T1_CWI_SHIFT
#define UART_WP7816_T_TYPE1_CWI(x)   UART_WP7816T1_CWI(x)
#define Watchdog_IRQn                WDOG_EWM_IRQn
#define Watchdog_IRQHandler          WDOG_EWM_IRQHandler
#define LPTimer_IRQn                 LPTMR0_IRQn
#define LPTimer_IRQHandler           LPTMR0_IRQHandler
#define LLW_IRQn                     LLWU_IRQn
#define LLW_IRQHandler               LLWU_IRQHandler

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* _MK24F25612_H_ */

